{
	"name": "Amunets Dungeon Randomizer - v0.1.11",
	"description": "Mod-ID: 2888909875\n\nA mod that provides Admins with an dynamic way of creating \"randomized\" dungeons for players to explore.\nThis mod is in early development, so unexpected behavior might occur.\n\n[hr][/hr]\n[h1]what it does[/h1]\nThis mod \"builds\" dungeons by placing building pieces (and some placeables) in the world, just like a player would do by hand. Unlike a player however, these buildings cannot loose stability.\n\n[hr][/hr]\n[h1]how to use[/h1]\nThere are basically two items right now.\n[list]\n\t[*][b]ADR DungeonFloor[/b] - the \"core\" of the mod.\n\tEach [b]ADR DungeonFloor[/b] has various settings, like the \"dungeon\" it belongs too, as well as the actual \"floor\" number it should be. Other than that, you can define the size of the area (currently limited to 96 by 96), the generation algorythm to use, as well as the \"theme\" (building pieces to be used) and others.\n\n\t[*][b]ADR DungeonHub[/b] - the \"entrance\" to the dungeon.\n\tThe [b]ADR DungeonHub[/b] only has one purpose - It functions as the \"portal\" to the dungeon, as well as the initiator for the generation.\n[/list]\n\nBasically you place any number of [b]ADR DungeonFloor[/b] somewhere in the world and set them to the same dungeon (as example \"Dungeon1\") but a different floor number.\nThen you place one [b]ADR DungeonHub[/b] to the \"entrance area\" with the matching dungeon (also \"Dungeon1\" in this example).\n\nTo create a dungeon any player would interact with the brazier.\nAs soon as the dungeon is ready, the portal will open and can be interacted with.\n\nCurrently there is no limit on generation, however it will refuse to build a new dungeon, as long as there are players in it.\n\n[hr][/hr]\n[h1]current features[/h1]\n[list]\n\t[*]Two basic algorythms:\n\tA \"default\" tunneler, which only builds corridors and rectangular rooms, seperated by doors.\n\tA \"cave\" builder, based on cellular automata.\n\n\t[*]Three basic themes:\n\tDefault (Stonebrick), Arena and Nemedia - both in a 1x and 2x variant.\n\n\t\"1x\"-themes handle each dungeon cell as a \"1 by 1 by 2\" building, while \"2x\"-themes handle them as \"2 by 2 by 2\" building\n[/list]\n\n[hr][/hr]\n[h1]known limitations[/h1]\nThere is no detection if a player logs out in a dungeon, so people might end up \"in the air\" outside of a newly generated dungeon.\nThe \"Arena\" and \"Nemedia\" themes are rather limited right now, having next to no decoration and variation in them, as they are mainly used to test the \"edge\" detection in the 2x logic.\n\n[hr][/hr]\n\nDiscord @ https://discord.gg/a8hGAKW\nPatreon @ https://www.patreon.com/sailorsat",
	"changeNote": "2023-11-?? - Amunets Dungeon Randomizer v0.1.11\n- new themes 'Pyramid' and 'Stormglass'\n- updated theme decoration options.",
	"author": "LilMissHentai",
	"authorUrl": "https://steamcommunity.com/id/sailorsat/",
	"versionMajor": 0,
	"versionMinor": 1,
	"versionBuild": 11,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2888909875",
	"steamTestLivePublishedFileId": "2931056766",
	"steamVisibility": 0,
	"folderName": "AmunetDungeonRandomizer",
	"revisionNumber": 543717,
	"snapshotId": 38653,
	"fileSize": -2
}